emacs/emacs.org
#+title: Emacs from Scratch configuration
#+STARTUP: overview
#+PROPERTY: header-args:emacs-lisp :tangle ./.emacs.d/init.el :mkdirp yes

* Basic configuration
** Package Setup
Definitely need some packages to improve Emacs, let's load the archives.
#+begin_src emacs-lisp
  ;; Initialize package sources
  (setq package-archives '(("org" . "https://orgmode.org/elpa/")
                           ("melpa" . "https://melpa.org/packages/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))
  
  ;; Straight.el
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
  
  (straight-use-package 'use-package)
  ;; Ok, putting this here gives me the latest version
  (straight-use-package 'org)
  (setq straight-use-package-by-default t)
  
  (require 'use-package)
#+end_src

** UI Config
*** Color Theme
#+begin_src emacs-lisp
  (use-package spacemacs-theme
    :defer t)
  
  (use-package one-themes
    :defer t)
  
  (use-package doom-themes
    :config
    (load-theme 'doom-tokyo-night t))
#+end_src
*** UI Changes
#+begin_src emacs-lisp
  (setq inhibit-startup-message t)
  
  (scroll-bar-mode -1) ; Disable scrollbar
  (tool-bar-mode -1) ; Disable toolbar
  (tooltip-mode -1) ; Disable tooltips
  
  (menu-bar-mode -1) ; Disable the menu bar
  
  ;; Set up the visual bell
  (setq visible-bell t)
  
  (electric-pair-mode 1)
  
  (column-number-mode)
  (global-display-line-numbers-mode t)
  
  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  vterm-mode-hook
                  nov-mode-hook
                  treemacs-mode-hook
                  org-agenda-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
  
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
  
  ;; Start Emacs fullscreen
  (custom-set-variables
   '(initial-frame-alist '((fullscreen . maximized))))
#+end_src
*** Font
I've got a bit to learn about fonts in Emacs, but this is a
start. I like the idea of having a different font for ~org-mode~, it
makes more sense to break up the headings.
#+begin_src emacs-lisp
  ;; Set the font a little bigger in OS X
  (if (memq window-system '(mac ns))
      (set-face-attribute 'default nil :font "FiraCode Nerd Font" :height 135)
    (set-face-attribute 'default nil :font "FiraCode Nerd Font" :height 100))
  
  ;; Set the variable pitch face
  (set-face-attribute 'fixed-pitch nil
                      :font "FiraCode Nerd Font Mono"
                      :height 135)
  
  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil
                      :font "Iosevka Etoile"
                      :height 135)
#+end_src
** Emacs auto-save & backup behavior
#+begin_src emacs-lisp
  (setq
   delete-old-versions t
   kept-new-versions 6
   kept-old-versions 2
   version-control t
   create-lockfiles nil
   backup-directory-alist
   `((".*" . ,temporary-file-directory))
   auto-save-file-name-transforms
   `((".*" ,temporary-file-directory t)))
#+end_src
*** Structure Templates
#+begin_src emacs-lisp
  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
#+end_src

#+begin_src emacs-lisp

#+end_src
** Auto-tangle on save
When I save my ~emacs.org~ file, write it to ~init.el~ so that I can
make use of my new functionality.
#+begin_src emacs-lisp
  (defvar nl/emacs-dotfile-directory "/Users/nland/dev/github.com/ndland/dotfiles/emacs/")
  (defvar nl/emacs-linux-dotfile-directory "/home/nland/dev/github.com/ndland/dotfiles/emacs/")
  
  ;; Automatically tangle our Emacs.org config file when we save it
  (defun nl/org-babel-tangle-config ()
    "This function is to automatically write to '~/.emacs.d/init.el'."
    (when
        (or
         (string-equal (file-name-directory (buffer-file-name)) nl/emacs-dotfile-directory)
         (string-equal (file-name-directory (buffer-file-name)) nl/emacs-linux-dotfile-directory))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))
  
  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'nl/org-babel-tangle-config)))
#+end_src
** Reload Emacs file
I'm tired of having to manually reload this file.
#+begin_src emacs-lisp
  (defun reload-emacs ()
    (interactive)
    (load-file "~/.emacs.d/init.el"))
#+end_src
** Search Org directory using ripgrep
#+begin_src emacs-lisp
  (defun nl/search-org-notes ()
    (interactive)
    (counsel-rg "" "~/Dropbox/org" nil "Search org notes: "))
#+end_src
** Start a server
#+begin_src emacs-lisp
  (server-start)
#+end_src
* Packages
** Keybindings
#+begin_src emacs-lisp
  (use-package evil
    :init
    (setq evil-want-keybinding nil)
    (setq evil-want-integration t)
    :config
    (evil-mode 1))

  (use-package evil-collection
    :after evil
    :init
    (evil-collection-init))

  (use-package general
    :config
    (general-create-definer nl/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")

    ;; nl is just an arbitrary name space can be changed
    (nl/leader-keys
      "a" '(:ignore t :which-key "Applications")
      ;; This comes after the prefix is triggered
      "at" '(vterm :which-key "Vterm")

      ;; This is the prefix
      "t" '(:ignore t :which-key "Toggles")
      ;; This comes after the prefix is triggered
      "tt" '(counsel-load-theme :which-key "Choose Theme")

      "f" '(:ignore t :which-key "File")
      "ff" '(counsel-find-file :which-key "Find File")
      "fs" '(save-buffer :which-key "Save File")
      "ft" '(treemacs :which-key "Toggle Treemacs")
      "fr" '(counsel-recentf :which-key "Recent Files")

      "g" '(:ignore t :which-key "Git")
      "gs" '(magit-status :which-key "Git Status")
      "gf" '(magit-gitflow-popup :which-key "Git Flow")

      "n" '(:ignore t :which-key "Notes")
      "ns" '(nl/search-org-notes :which-key "Search org notes")

      "o" '(:ignore t :which-key "Org")
      "oa" '(org-agenda :which-key "Org Agenda")
      "oc" '(org-capture :which-key "Org Capture")
      "oh" '(org-archive-subtree-default :which-key "Org Archive")
      "or" '(org-refile :which-key "Org Refile")
      "ot" '(org-todo :which-key "Org TODO")
      "oi" '(org-time-stamp-inactive :which-key "Org timestamp inactive")

      "s" '(:ignore t :which-key "Snippets")
      "si" '(yas-insert-snippet :which-key "Insert Snippet")
      "sn" '(yas-new-snippet :which-key "New Snippet")

      "b" '(:ignore t :which-key "Buffers")
      "bb" '(counsel-ibuffer :which-key "Switch Buffers")))
#+end_src
