emacs/emacs.org
** Org Mode
#+begin_src emacs-lisp
  (defun nl/org-heading-setup ()
    ;; Scale headings
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.05)
                    (org-level-5 . 1.05)
                    (org-level-6 . 1.05)
                    (org-level-7 . 1.05)
                    (org-level-8 . 1.05)))
      (set-face-attribute (car face) nil :font "Iosevka Etoile" :weight 'normal :height (cdr face))))
  
  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  
  (defun nl/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (auto-fill-mode 1))
  
  (use-package org
    :bind ([remap org-set-tags-command] . #'counsel-org-tag)
    :hook (org-mode . nl/org-mode-setup)
    :config
    (setq org-log-into-drawer t)
    ;; (setq org-agenda-files '("~/Dropbox/org/inbox.org"))
    (setq org-contacts-files '("~/Dropbox/org/inbox.org"))
  
    (setq org-ellipsis " ⌄"
          org-hide-emphasis-markers t)
  
    (setq org-habit-graph-column 60)
    (setq org-tags-column 120
          org-auto-align-tags t)
    (setq org-startup-with-inline-images t
          org-image-actual-width 500)
  
    (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-date nil     :inherit 'fixed-pitch)
    (set-face-attribute 'org-link nil     :inherit 'fixed-pitch)
    (set-face-attribute 'org-checkbox-statistics-todo nil :inherit 'fixed-pitch :foreground "DarkOrange1")
    (set-face-attribute 'org-checkbox-statistics-done nil :inherit 'fixed-pitch :foreground "lime green")
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-agenda-calendar-sexp nil :inherit 'variable-pitch :foreground "LemonChiffon")
  
    (setq org-refile-targets '((org-agenda-files :maxlevel . 3)))
  
    (setq org-outline-path-complete-in-steps nil)
    (setq org-refile-use-outline-path t)
  
    (setq org-todo-keywords
          '((sequence "TODO(t)" "NEXT(n!)" "|" "DONE(d!)")
            (sequence "BACKLOG(b!)" "PLAN(p!)" "READY(r!)" "ACTIVE(a!)" "REVIEW(e!)" "WAITING(w@/!)" "HOLD(h@/!)" "|" "COMPLETED(c!)" "CANCELLED(l@/!)")))
  
    (setq org-todo-keyword-faces
          '(("TODO" . (:foreground "red" :weight bold))
            ("NEXT" . (:foreground "gold" :weight bold))
            ("DONE" . (:foreground "lime green" :weight bold))
            ("BACKLOG" . (:foreground "dim gray" :weight regular))
            ("PLAN" . (:foreground "orange red" :weight regular))
            ("READY" . (:foreground "spring green" :weight bold))
            ("ACTIVE" . (:foreground "yellow" :weight bold))
            ("REVIEW" . (:foreground "orange" :weight bold))
            ("WAITING" . (:foreground "salmon" :weight bold))
            ("HOLD" . (:foreground "tomato" :weight bold))
            ("COMPLETED" . (:foreground "lime green" :weight bold))
            ("CANCELLED" . (:foreground "red" :weight bold))))
  
    (setq org-capture-templates
          '(("t" "Tasks")
            ("tt" "Task" entry
             (file+olp "~/Dropbox/org/inbox.org" "Inbox")
             "* TODO %?\nCaptured: %U\n%a\n %i"
             :empty-lines 0)
            ("td" "Task Today" entry
             (file+olp "~/Dropbox/org/inbox.org" "Inbox")
             "* TODO %?\nSCHEDULED: %t\nCaptured: %U\n%a\n %i"
             :empty-lines 0)
            ("c" "Contacts")
            ("cf" "Family" entry (file+headline "~/Dropbox/org/inbox.org" "Family")
             "* %(org-contacts-template-name)
  :PROPERTIES:
  :ADDRESS: %^{289 Cleveland St. Brooklyn, 11206 NY, USA}
  :BIRTHDAY: %^{yyyy-mm-dd}
  :EMAIL: %^{Email}
  :PHONE:
  :ALIAS:
  :NICKNAME:
  :IGNORE:
  :ICON:
  :NOTE: %^{Note}
  :END:"
             :empty-lines 0)
            ("cr" "Friends" entry (file+olp "~/Dropbox/org/inbox.org" "Contacts" "Friends")
             "* %(org-contacts-template-name)
  :PROPERTIES:
  :ADDRESS: %^{289 Cleveland St. Brooklyn, 11206 NY, USA}
  :BIRTHDAY: %^{yyyy-mm-dd}
  :EMAIL: %^{Email}
  :PHONE:
  :ALIAS:
  :NICKNAME:
  :IGNORE:
  :ICON:
  :NOTE: %^{Note}
  :END:"
             :empty-lines 0)))
  
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (C . t)))
  
    (setq org-tag-alist
          '((:startgroup)
            (:endgroup)
            ("@home" . ?H)
            ("@errand" . ?E)
            ("@work" . ?W)
            ("finance" . ?F)
            ("event" . ?v)
            ("habit" . ?a)
            ("chore" . ?C)
            ("plex" . ?P)
            ("hobbies" . ?h)
            ("productivity" . ?p)
            ("emacs" . ?e)
            ("repair" . ?r)))
  
    (nl/org-heading-setup)
  
    (general-define-key
     :states '(normal visual)
     :keymaps 'org-mode-map
     "TAB" 'org-cycle)
  
    (general-define-key
     :states '(normal insert visual emacs)
     :keymaps 'org-agenda-mode-map
     "j" 'org-agenda-next-line
     "k" 'org-agenda-previous-line))
  
  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode))
  
  (defun nl/org-mode-visual-fill ()
    (setq visual-fill-column-width 130
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))
  
  (use-package visual-fill-column
    :hook (org-mode . nl/org-mode-visual-fill))
  
  (use-package org-contrib
    :after org
    :config
    (require 'org-contacts))
#+end_src

** Ivy, Counsel, & Swiper
#+begin_src emacs-lisp
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :init
    (ivy-mode 1)
    :config
    (setq ivy-use-virtual-buffers t))
  
  (use-package ivy-rich
    :after counsel
    :init (ivy-rich-mode 1))
  
  (use-package all-the-icons-ivy-rich
    :ensure t
    :init (all-the-icons-ivy-rich-mode 1))
  
  (use-package counsel
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-ibuffer)
           ("C-x C-f" . counsel-find-file)
           ("C-x C-r" . counsel-recentf)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :init (counsel-mode 1))
#+end_src
** Helpful Help Buffers
This package offers some really helpful (no pun intended) help buffers. Presents the help in a nice way.
#+begin_src emacs-lisp
  (use-package helpful
    :commands (helpful-callable helpful-variable helpful-command helpful-key)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src
** Better Mode line
I'm using [[https://github.com/seagle0128/doom-modeline][Doom Modeline]] with some nifty icons (All The Icons) to spruce it up a little bit.
#+begin_src emacs-lisp
  (use-package doom-modeline
    :ensure t
    :hook (after-init . doom-modeline-mode))

  (use-package all-the-icons)
#+end_src
