emacs/emacs.org
** Git
#+begin_src emacs-lisp
  (use-package magit
    :commands (magit-status magit-get-current-branch)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  (use-package evil-nerd-commenter
    :bind ("C-/" . evilnc-comment-or-uncomment-lines))

  (use-package magit-gitflow
    :after magit
    :hook
    (magit-mode . turn-on-magit-gitflow))

  (use-package diff-hl
    :hook
    ((magit-pre-refresh . diff-hl-magit-pre-refresh)
     (magit-post-refresh . diff-hl-magit-post-refresh))
    :init
    (global-diff-hl-mode))

  (if (memq window-system '(mac ns))
      (use-package magit-delta
        :after magit
        :config
        (add-hook 'magit-mode-hook (lambda () (magit-delta-mode +1)))))
#+end_src
** Which Key
I don't have to remember the keybinds anymore. This will help remind me what the binds are!
#+begin_src emacs-lisp
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))
#+end_src
** Auto completion
#+begin_src emacs-lisp
  (use-package company
    :ensure t
    :after lsp-mode
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))
  
  (use-package company-box
    :after company-mode
    :hook (company-mode . company-box-mode))
#+end_src
** Emojis
I have this here because I use Gitmoji for my commit messages, and this allows me to see the emojis in the editor.
#+begin_src emacs-lisp
  (use-package emojify
    :hook (after-init . global-emojify-mode))
#+end_src
** On the fly syntax checking
#+begin_src emacs-lisp
  (use-package flycheck
    :config
    (global-flycheck-mode)
    (setq-default flycheck-disabled-checkers
                  (append flycheck-disabled-checkers
                          '(javascript-jshint)))
    (setq-default flycheck-disabled-checkers
                  (append flycheck-disabled-checkers
                          '(json-jsonlist)))
    (flycheck-add-mode 'javascript-eslint 'web-mode))
#+end_src
** Snippets
#+begin_src emacs-lisp
  (use-package yasnippet
    :config (yas-global-mode 1))

  (use-package yasnippet-snippets
    :after yasnippet)
#+end_src
** Projects
#+begin_src emacs-lisp
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (when (file-directory-p "~/dev")
      (setq projectile-project-serach-path '("~/dev")))
    ;; When you switch projects, load dired first
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package counsel-projectile
    :config (counsel-projectile-mode))
#+end_src
** Better OSX integration
When I'm using Mac OS X, Include this package to help with making
my $PATH available to Emacs.
#+begin_src emacs-lisp
  (when (memq window-system '(mac ns x))
    (use-package exec-path-from-shell
      :init
      (exec-path-from-shell-initialize)))
#+end_src
** Reload Emacs
I'm tired of doing this manually.
#+begin_src emacs-lisp
  (use-package restart-emacs)
#+end_src

** UI enhancements
*** Treemacs
#+begin_src emacs-lisp
  (use-package lsp-treemacs
    :after lsp)

  (use-package treemacs-evil
    :after (treemacs evil)
    :ensure t)

  (use-package treemacs-projectile
    :after (treemacs projectile)
    :ensure t)

  (use-package treemacs-magit
    :after (treemacs magit)
    :ensure t)
#+end_src
*** Golden Ratio
This is a neat package that will automatically resize your splits for
you!
#+begin_src emacs-lisp
  (use-package golden-ratio
    :config (golden-ratio-mode 1))

  (define-advice select-window (:after (window &optional no-record) golden-ratio-resize-window)
      (golden-ratio)
      nil)
#+end_src

** Window switching
#+begin_src emacs-lisp
  (use-package ace-window
    :bind
    ("M-o" . ace-window)
    :config (ace-window-display-mode 1))
#+end_src
** Terminal
#+begin_src emacs-lisp
  (use-package vterm)
#+end_src
** Read Books
#+begin_src emacs-lisp
  (use-package nov
    :config
    (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
    (setq nov-text-width 120))
#+end_src
** Plain Text Accounting
#+begin_src emacs-lisp
  (use-package beancount-mode
    :straight (beancount-mode
               :type git
               :host github
               :repo "beancount/beancount-mode")
    :hook
    (beancount-mode . outline-minor)
    :bind
    ("C-c C-n" . outline-next-visible-heading)
    ("C-c C-p" . outline-previous-visible-heading)
    :mode
    ("\\.bean\\(?:count\\)?\\'" . beancount-mode))
  
  (use-package ledger-mode
    :mode "\\.ledger\\'"
    :after company
    :init
    (add-hook 'ledger-mode-hook 'company-mode)
    :config
    (add-hook 'ledger-mode-hook
              (lambda ()
                (setq-local tab-always-indent 'complete)
                (setq-local completion-cycle-threshold t)
                (setq-local ledger-complete-in-steps t)))
    (setq ledger-post-amount-alignment-at :end)
    (setq ledger-post-amount-alignment-column 100))
#+end_src

* Languages
*** Markdown
#+begin_src emacs-lisp
  ;; Markdown
  (use-package markdown-mode
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :init (setq markdown-command "pandoc"))
#+end_src
*** Web
#+begin_src emacs-lisp
  (use-package json-mode
    :mode "\\.json$")
  
  (use-package rjsx-mode
    :mode (("\\.js\\'" . rjsx-mode)
           ("\\.jsx\\'" . rjsx-mode)
           ("\\.tsx\\'" . rjsx-mode)
           ("\\.ts\\'" . rjsx-mode))
    :config (setq js-indent-level 2))
  
  ;; (use-package typescript-mode
  ;;  :mode (("\\.tsx\\'" . typescript-mode)))
  
  (defun setup-tide-mode()
    "Setup function for tide"
    (interactive)
    (tide-setup)
    (flycheck-mode +1)
    (setq flycheck-check-syntax-automatically '(save mode-enabled))
    (company-mode +1))
  
  (use-package tide
    :after (typescript-mode company flycheck)
    :hook (typescript-mode . setup-tide-mode))
  
  ;; (use-package js2-mode)
  
  (use-package web-mode
    :mode (("\\.js\\'" . web-mode)
           ;; ("\\.jsx\\'" . web-mode)
           ;; ("\\.ts\\'" . web-mode)
           ("\\.html\\'" . web-mode))
           ;; ("\\.tsx\\'" . web-mode))
    :hook ((web-mode . lsp-deferred))
    :config
    (setq company-tooltip-align-annotations t)
    (setq web-mode-markup-indent-offset 2)
    (setq web-mode-css-indent-offset 2)
    (setq web-mode-code-indent-offset 2))
    ;; (setq web-mode-content-types-alist
    ;;       '(("tsx" . "\\.ts[x]?\\'"))))
  
  (use-package prettier-js
    :after (rjsx-mode)
    :hook ((json-mode . prettier-js-mode)
           (rjsx-mode . prettier-js-mode)))
#+end_src
*** Language Server Protocol (lsp-mode)
#+begin_src emacs-lisp
  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (prog-mode . lsp-deferred)
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t))

  (use-package lsp-ivy
    :after lsp
    :commands lsp-ivy-workspace-symbol)

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))
#+end_src
*** Yaml
#+begin_src emacs-lisp
  (use-package yaml-mode
    :config
    (add-hook 'yaml-mode-hook
              (lambda ()
                (define-key yaml-mode-map "\C-m" 'newline-and-indent))))
#+end_src
*** Golang
#+begin_src emacs-lisp
  ;; Set up before-save hooks to format buffer and add/delete imports.
  ;; Make sure you don't have other gofmt/goimports hooks enabled.
  (defun lsp-go-install-save-hooks ()
    (add-hook 'before-save-hook #'lsp-format-buffer t t)
    (add-hook 'before-save-hook #'lsp-organize-imports t t))
  (add-hook 'go-mode-hook #'lsp-go-install-save-hooks)

  (use-package go-mode
    :mode "\\.go$"
    :config
    (add-hook 'go-mode-hook 'lsp-deferred)
    (lsp-go-install-save-hooks)

    (lsp-register-custom-settings
     '(("gopls.completeUnimported" t t)
       ("gopls.staticcheck" t t))))
#+end_src
